Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/CommonModules/SUI_НастройкиДокументовКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьПредопределенныйАлгоритм(ИмяДокумента, Ключ) Экспорт
	
	//TODO: 10.09.2024 - artem - Реализовать предопределенные алгоритмы
	Возврат "";
	
КонецФункции

Функция ПолучитьИменаОсновныхРеквизитовТаблиц(РеквизитыДокумента = Истина, ТипТаблицы = Неопределено) Экспорт
	
	ОсновныеРеквизиты = Новый СписокЗначений();
	
	Если РеквизитыДокумента Тогда
		
		ОсновныеРеквизиты.Добавить("НомерДокументаОснования", 	НСтр("ru = 'Номер'"), Истина);
		ОсновныеРеквизиты.Добавить("ДатаДокументаОснования", 	НСтр("ru = 'Дата'"), Истина);
		ОсновныеРеквизиты.Добавить("Контрагент", 				НСтр("ru = 'Контрагент'"));
		ОсновныеРеквизиты.Добавить("Склад", 					НСтр("ru = 'Склад'"));
		ОсновныеРеквизиты.Добавить("ПризнакМаркировки", 		НСтр("ru = 'Признак маркировки'"));
		
	Иначе
		
		Если ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары") Или
			ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор") Или
			ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение") Или
			ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии") Или
			ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок") Тогда
			
			// Номенклатура
			ОсновныеРеквизиты.Добавить("Номенклатура", 	НСтр("ru = 'Номенклатура'"), 
				(ТипТаблицы <> ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок") И
				ТипТаблицы <> ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии")));
			
			// Характеристика
			ОсновныеРеквизиты.Добавить("Характеристика", НСтр("ru = 'Характеристика'"));
			
			// Упаковка
			Если ТипТаблицы <> ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии") Тогда
				ОсновныеРеквизиты.Добавить("Упаковка", НСтр("ru = 'Упаковка'"));
			КонецЕсли;
			
			Если ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок") Тогда
				// ШтрихкодУпаковки
				ОсновныеРеквизиты.Добавить("ШтрихкодУпаковки", НСтр("ru = 'Штрихкод упаковки'"), Истина);
				// ЗначениеШтрихкода
				ОсновныеРеквизиты.Добавить("ЗначениеШтрихкода", НСтр("ru = 'Значение штрихкода'"));
			ИначеЕсли ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии") Тогда
				
				// Серия
				ОсновныеРеквизиты.Добавить("Серия", НСтр("ru = 'Серия'"), Истина);
				// Наименование
				ОсновныеРеквизиты.Добавить("Наименование", НСтр("ru = 'Наименование'"));
				// Номер
				ОсновныеРеквизиты.Добавить("Номер", НСтр("ru = 'Номер'"));
				// Дата производства
				ОсновныеРеквизиты.Добавить("ДатаПроизводства", НСтр("ru = 'Дата производства'"));
				// Годен до
				ОсновныеРеквизиты.Добавить("ГоденДо", НСтр("ru = 'Годен до'"));
				
			КонецЕсли;
			
			Если ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары") Или
				ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор") Или
				ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение") Тогда
				
				// СтатусУказанияСерии
				ОсновныеРеквизиты.Добавить("СтатусУказанияСерии", НСтр("ru = 'Статус указания серии'"));
				
				Если ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор") Или
					ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение") Тогда
					// Ячейка
					ОсновныеРеквизиты.Добавить("Ячейка", НСтр("ru = 'Ячейка'"), Истина);
				Иначе
					// ПризнакМаркировки
					ОсновныеРеквизиты.Добавить("ПризнакМаркировки", НСтр("ru = 'Признак маркировки'"));
					// ВидЦены
					ОсновныеРеквизиты.Добавить("ВидЦены", НСтр("ru = 'Вид цены'"));
					// Цена
					ОсновныеРеквизиты.Добавить("Цена", НСтр("ru = 'Цена'"));
				КонецЕсли;
				
				// КоличествоПлан
				ОсновныеРеквизиты.Добавить("КоличествоПлан", НСтр("ru = 'Количество (план)'"), Истина);
				
			КонецЕсли;
			
			Если ТипТаблицы <> ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок") Тогда
				// КоличествоФакт
				ОсновныеРеквизиты.Добавить("КоличествоФакт", НСтр("ru = 'Количество (факт)'"), 
					ТипТаблицы <> ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии"));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОсновныеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Настройки документов'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АлгоритмыОбработкиСтрокДокумента

Функция АлгоритмОбработкиСтрокДокумента_ПриобретениеТоваровУслуг(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий = Новый Структура;
		|СтруктураДействий.Вставить(""ПроверитьЗаполнитьСклад"", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(ДокументОбъект, Ложь));
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|
		|СтруктураДействий.Вставить(""ЗаполнитьСтавкуНДС"", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ДокументОбъект));
		|СтруктураДействий.Вставить(""ЗаполнитьСтавкуНДСВозвратнойТары"", ДокументОбъект.ВернутьМногооборотнуюТару);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомРучнойСкидки"", Новый Структура(""Очищать"", Истина));
		|СтруктураДействий.Вставить(""ОчиститьСуммуВзаиморасчетов"");
		|СтруктураДействий.Вставить(""ЗаполнитьСлужебныеРеквизитыПоНазначению"");
		|	
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		|
		|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.ПриобретениеТоваровУслуг""));
		|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока));
		|
		|Если НоменклатураКлиентСервер.ВЭтомСтатусеСерииУказываютсяВТЧТовары(ТекущаяСтрока.СтатусУказанияСерий, ПараметрыУказанияСерий) Тогда
		|	НоменклатураКлиентСервер.ПересчитатьСтатусУказанияСерийПриОбработке(ПараметрыУказанияСерий, ТекущаяСтрока.СтатусУказанияСерий, 
		|		ЗначениеЗаполнено(ТекущаяСтрока.Серия), Неопределено, 
		|		?(ПараметрыУказанияСерий.ЭтоЗаказ, ТекущаяСтрока.ВариантОбеспечения, Неопределено), ТекущаяСтрока);
		|Иначе
		|	
		|	ПараметрыОтбора = Новый Структура(""Номенклатура,Характеристика,Склад"", 
		|		ТекущаяСтрока.Номенклатура, 
		|		ТекущаяСтрока.Характеристика,
		|		ТекущаяСтрока.Склад);
		|		
		|	КоличествоСерий = 0;
		|	Для Каждого СтрокаСерия Из ДокументОбъект.Серии.НайтиСтроки(ПараметрыОтбора) Цикл
		|		КоличествоСерий = КоличествоСерий + СтрокаСерия.Количество;
		|	КонецЦикла;
		|	
		|	ТекущаяСтрока.Серия = Неопределено;
		|
		|	НоменклатураКлиентСервер.ПересчитатьСтатусУказанияСерийПриОбработке(ПараметрыУказанияСерий, 
		|		ТекущаяСтрока.СтатусУказанияСерий, 
		|		(ЗначениеЗаполнено(ТекущаяСтрока.КоличествоУпаковок) И ТекущаяСтрока.КоличествоУпаковок = КоличествоСерий), 
		|		КоличествоСерий, 
		|		?(ПараметрыУказанияСерий.ЭтоЗаказ, ТекущаяСтрока.ВариантОбеспечения, Неопределено), ТекущаяСтрока);
		|
		|КонецЕсли;";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ВозвратТоваровОтКлиента(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		|
		|мсвСтроки = Новый Массив();
		|мсвСтроки.Добавить(ТекущаяСтрока);
		|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.ВозвратТоваровОтКлиента""));
		|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, мсвСтроки);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ВозвратТоваровПоставщику(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		|
		|мсвСтроки = Новый Массив();
		|мсвСтроки.Добавить(ТекущаяСтрока);
		|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.ВозвратТоваровПоставщику""));
		|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, мсвСтроки);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ЗаказКлиента(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомРучнойСкидки"", Новый Структура(""Очищать"", Ложь));
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомАвтоматическойСкидки"", Новый Структура(""Очищать"", Истина));
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами"");
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		|
		|мсвСтроки = Новый Массив();
		|мсвСтроки.Добавить(ТекущаяСтрока);
		|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.ЗаказКлиента""));
		|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, мсвСтроки);";
	
КонецФункции

Функция АлгоритмОбработкиСтрокДокумента_ЗаказПоставщику(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомРучнойСкидки"", Новый Структура(""Очищать"", Ложь));
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ПеремещениеТоваров(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ПересчетТоваров(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиницСуффикс"", ""Факт"");
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ПриходныйОрдерНаТовары(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.ПриходныйОрдерНаТовары));
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПроверитьСериюРассчитатьСтатус"", Новый Структура(""Склад, ПараметрыУказанияСерий"", ДокументОбъект.Склад, ПараметрыУказанияСерий));
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_РасходныйОрдерНаТовары(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.РасходныйОрдерНаТовары));
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПроверитьСериюРассчитатьСтатус"", Новый Структура(""Склад, ПараметрыУказанияСерий"", ДокументОбъект.Склад, ПараметрыУказанияСерий.ОтгружаемыеТовары));
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции

Функция АлгоритмОбработкиСтрокДокумента_РеализацияТоваровУслуг(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
             |СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
             |СтруктураДействий.Вставить(""ПроверитьЗаполнитьСклад"", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(ДокументОбъект, Ложь));
             |СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
             |СтруктураДействий.Вставить(""ЗаполнитьСтавкуНДС"", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ДокументОбъект));
             |СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
             |СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
             |СтруктураДействий.Вставить(""ПересчитатьСумму"");
             |СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомРучнойСкидки"", Новый Структура(""Очищать"", Ложь));
             |СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомАвтоматическойСкидки"", Новый Структура(""Очищать"", Истина));
             |СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами"");
             |СтруктураДействий.Вставить(""ОчиститьСуммуВзаиморасчетов"");
             |ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
             |
			|мсвСтроки = Новый Массив();
			|мсвСтроки.Добавить(ТекущаяСтрока);
			|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.РеализацияТоваровУслуг""));
			|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, мсвСтроки);";
	
КонецФункции  

Функция АлгоритмОбработкиСтрокДокумента_СборкаТоваров(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции

Функция АлгоритмОбработкиСтрокДокумента_ОтборРазмещениеТоваров(Параметры)
	
	Если Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоОтбор") Тогда
		Возврат "ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.ОтборРазмещениеТоваров);
        |
		|СтруктураДействий = Новый Структура;  
		|СтруктураДействий.Вставить(""ПроверитьСериюРассчитатьСтатус"", Новый Структура(""Склад, ПараметрыУказанияСерий"", ДокументОбъект.Склад, ПараметрыУказанияСерий.Отбор));
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ЗаполнитьСлужебныеРеквизитыПоНазначению"");
		|	
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	Иначе
		Возврат "ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.ОтборРазмещениеТоваров);
        |
		|СтруктураДействий = Новый Структура;  
		|СтруктураДействий.Вставить(""ПроверитьСериюРассчитатьСтатус"", Новый Структура(""Склад, ПараметрыУказанияСерий"", ДокументОбъект.Склад, ПараметрыУказанияСерий.Размещение));
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ЗаполнитьСлужебныеРеквизитыПоНазначению"");
		|	
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
